// RangeBasedFor.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>
using namespace std;


int main()
{
    int aList[5] = { 10, 20, 30, 40, 50 };

    //전형적인 C스타일 반복문
    for (int i = 0; i < 5; ++i) {
        cout << aList[i] << ' ';
    }

    cout << endl;

    //범위 기반 반목문
    //각 요소의 값을 n에 복사하는 형식
    for (auto n : aList)
        cout << n << ' ';

    cout << endl;

    // n은 각 요소에 대한 참조다
    // 배열의 요소 개수가 변화하여도 범위기반 for문은 코드를 수정할 필요가 없다. (C스타일 반복문의 경우 요소개수의 변화가 있으면 반드시 반복문의 조건을 수정해야 함)
    for (auto& n : aList)
        cout << n << ' ';

    cout << endl;

    return 0;
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
